Repository: levsh/arrlio
Catalog: arrlio/locales/*/LC_MESSAGES/*.po
Languages: ru

source: Send task to backend.
ru: Отправить задачу на бэкенд.

source: Consume tasks from the queues and invoke `callback` on `arrlio.models.TaskInstance` received.
ru: Начать слушать задачи из очередей и вызвать функцию обратного `callback` вызова при получении `arrlio.models.TaskInstance`

source: Stop consuming tasks.
ru: Перестать слушать задачи.

source: Make result backend headers for `arrlio.models.TaskInstance`.
ru: Создать заголовки для `arrlio.models.TaskInstance`.

source: Make result backend shared for `arrio.models.TaskInstance`.
ru: Создать общий объект бэкенда результата для `arrlio.models.TaskInstance`.

source: Allocate storage for future task result if needed.
ru: Выделить хранилище для будущего результата задачи если необходимо.

source: Push `arrlio.models.TaskResult` for `arrlio.models.TaskInstance`.
ru: Сохранить `arrlio.models.TaskResult` для `arrlio.models.TaskInstance`.

source: Pop `arrlio.models.TaskResult` for `arrlio.models.TaskInstance`.
ru: Получить `arrlio.models.TaskResult` для `arrlio.models.TaskInstance`.

source: Close task.
ru: Закрыть задачу.

source: Send `arrlio.models.Event`.
ru: Послать `arrlio.models.Event`.

source: Consume events and invoke `callback` on `arrlio.models.Event` received.
ru: Начать слушать эвенты и вызвать функцию обратного вызова при получении `arrlio.models.Event`.

source: Stop consuming events.
ru: Перестать слушанть эвенты.
